RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
/*
 * $ Copyright Cypress Semiconductor $
*/

/**
* @file cy_wcm.c
* @brief Wi-Fi connection manager (WCM) provides set of APIs that are useful
* to establish and monitor Wi-Fi connection on Cypress platforms that support Wi-Fi connectivity.
* WCM APIs are easy to use compared to WHD APIs and also provides additional features.
* Refer individual APIs for more details.
*/

#include <stdlib.h>

#include "cy_wcm.h"
#include "cy_wcm_log.h"
#include "cy_wcm_error.h"
#include "whd.h"
#include "cyabs_rtos.h"
#include "whd_chip_constants.h"
#include "whd_wlioctl.h"
#include "cybsp_wifi.h"

/*****************************************************************************
 * Macros
 *****************************************************************************/



/* Chip identifiers for WLAN CPUs */
#define CY_WCM_WLAN_CHIP_ID_43907        (43907u)    /**< Chip Identifier for 43907 */
#define CY_WCM_WLAN_CHIP_ID_43909        (43909u)    /**< Chip Identifier for 43909 */
#define CY_WCM_WLAN_CHIP_ID_54907        (54907u)    /**< Chip Identifier for 54907 */


/* Deepsleep time for WLAN CPU */
#ifndef DEFAULT_PM2_SLEEP_RET_TIME
    #define DEFAULT_PM2_SLEEP_RET_TIME       (200)
#endif

#if defined(ENABLE_MULTICORE_CONN_MW) && defined(USE_VIRTUAL_API)

#include <stdbool.h>
#include "cy_wcm_internal.h"
#include "cy_vcm_internal.h"

/* This section is virtual-only implementation.
 * The below APIs send the API request to the other core via IPC using the Virtual Connectivity Manager (VCM) library.
 */

static bool                      is_wcm_initialized = false;
static cy_wcm_event_callback_t   virtual_wcm_event_handler[CY_WCM_MAXIMUM_CALLBACKS_COUNT];
static bool                      is_virtual_event_handler_registered = false;
static cy_mutex_t                event_handler_mutex;

static void virtual_event_handler(void *arg)
{
    cy_rslt_t                       res;
    uint8_t                         i;
    cy_wcm_event_callback_t         event_cb;
    cy_wcm_event_callback_params_t  *wcm_event;

    wcm_event = (cy_wcm_event_callback_params_t *)arg;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Acquiring Mutex %p ", event_handler_mutex);
    res = cy_rtos_get_mutex(&event_handler_mutex, CY_RTOS_NEVER_TIMEOUT);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)res);
        return;
    }

    /* Call the WCM callbacks registered by the application */
    for (i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++)
    {
        if (virtual_wcm_event_handler[i] != NULL)
        {
            event_cb = virtual_wcm_event_handler[i];
            event_cb(wcm_event->event, wcm_event->event_data);
        }
    }

    res = cy_rtos_set_mutex(&event_handler_mutex);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)res);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Releasing Mutex %p ", event_handler_mutex);
}

static cy_rslt_t register_virtual_wcm_event_handler()
{
    CY_SECTION_SHAREDMEM
    static cy_wcm_register_event_callback_params_t params;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_vcm_request_t   api_request;
    cy_vcm_response_t  api_response;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "First event callback registration from the secondary core \n");

    params.event_callback = virtual_event_handler;
    memset(&api_request, 0, sizeof(cy_vcm_request_t));
    api_request.api_id = CY_VCM_API_WCM_REG_EVENT_CB;
    api_request.params = &params;

    result = cy_vcm_send_api_request(&api_request, &api_response);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_vcm_send_api_request failed for cy_wcm_register_event_callback \n");
        return CY_RSLT_WCM_VCM_ERROR;
    }
    if (api_response.result == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "api_response.result is NULL\n");
        return CY_RSLT_WCM_VCM_ERROR;
    }

    is_virtual_event_handler_registered = true;

    return (*((cy_rslt_t *)api_response.result));
}

static cy_rslt_t deregister_virtual_wcm_event_handler()
{
    CY_SECTION_SHAREDMEM
    static cy_wcm_deregister_event_callback_params_t params;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_vcm_request_t   api_request;
    cy_vcm_response_t  api_response;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "De-register the callback with the secondary core as all WCM callbacks are removed \r\n");

    params.event_callback = virtual_event_handler;
    memset(&api_request, 0, sizeof(cy_vcm_request_t));
    api_request.api_id = CY_VCM_API_WCM_DEREG_EVENT_CB;
    api_request.params = &params;

    result = cy_vcm_send_api_request(&api_request, &api_response);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_vcm_send_api_request failed for cy_wcm_deregister_event_callback \n");
        return CY_RSLT_WCM_VCM_ERROR;
    }
    if (api_response.result == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "api_response.result is NULL\n");
        return CY_RSLT_WCM_VCM_ERROR;
    }
    is_virtual_event_handler_registered = false;

    return (*((cy_rslt_t *)api_response.result));
}

cy_rslt_t cy_wcm_init(cy_wcm_config_t *config)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    int i;

    UNUSED_PARAMETER(config);

    if (is_wcm_initialized == true)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "\n WCM library is already initialized. \n");
        return res;
    }

    res = cy_rtos_init_mutex2(&event_handler_mutex, false);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Failed to initialize mutex. Res: 0x%x\n", res);
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    for (i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++)
    {
        virtual_wcm_event_handler[i] = NULL;
    }

    is_wcm_initialized = true;

    return res;
}

uint8_t cy_wcm_is_connected_to_ap(void)
{
    cy_vcm_request_t   api_request;
    cy_vcm_response_t  api_response;
    cy_rslt_t          res = CY_RSLT_SUCCESS;
    uint8_t            is_connected = 0;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_wcm_is_connected_to_ap starts in secondary core\n");

    if (!is_wcm_initialized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init() \n");
        return is_connected;
    }

