RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
    /* Set API request */
    memset(&api_request, 0, sizeof(cy_vcm_request_t));
    api_request.api_id = CY_VCM_API_WCM_IS_CONNECTED_AP;
    api_request.params = NULL;

    /* Send API request */
    res = cy_vcm_send_api_request(&api_request, &api_response);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_vcm_send_api_request failed for cy_wcm_is_connected_to_ap\n");
        return is_connected;
    }
    if (api_response.result == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "api_response.result is NULL\n");
        return is_connected;
    }
    is_connected = (*(uint8_t*)(api_response.result));
    return is_connected;
}

cy_rslt_t cy_wcm_register_event_callback(cy_wcm_event_callback_t event_callback)
{
    cy_rslt_t         result;
    uint8_t           i;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_wcm_register_event_callback starts in secondary core\n");

    if (!is_wcm_initialized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if (event_callback == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments to cy_wcm_register_event_callback(). \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Acquiring Mutex %p ", event_handler_mutex);
    result = cy_rtos_get_mutex(&event_handler_mutex, CY_RTOS_NEVER_TIMEOUT);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)result);
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    if (is_virtual_event_handler_registered == false)
    {
        /* First register event api_request */
        virtual_wcm_event_handler[0] = event_callback;

        result = register_virtual_wcm_event_handler();
        if (result != CY_RSLT_SUCCESS)
        {
            goto exit;
        }
    }
    else
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Event callback registration from the secondary core \n");
        for (i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++)
        {
            if (virtual_wcm_event_handler[i] == NULL)
            {
                virtual_wcm_event_handler[i] = event_callback;
                result = CY_RSLT_SUCCESS;
                break;
            }
        }
        if (i == CY_WCM_MAXIMUM_CALLBACKS_COUNT)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Out of CY_WCM_MAXIMUM_CALLBACKS_COUNT \r\n");
            result = CY_RSLT_WCM_OUT_OF_MEMORY;
            goto exit;
        }
    }

exit:
    if (cy_rtos_set_mutex(&event_handler_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)result);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Releasing Mutex %p ", event_handler_mutex);

    return result;
}

cy_rslt_t cy_wcm_deregister_event_callback(cy_wcm_event_callback_t event_callback)
{
    cy_rslt_t         result;
    uint8_t           i;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_wcm_deregister_event_callback starts in secondary core\n");

    if (!is_wcm_initialized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if (event_callback == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments to cy_wcm_deregister_event_callback(). \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Acquiring Mutex %p ", event_handler_mutex);
    result = cy_rtos_get_mutex(&event_handler_mutex, CY_RTOS_NEVER_TIMEOUT);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)result);
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    if (is_virtual_event_handler_registered == false)
    {
        /* No callbacks to remove */
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to find callback to deregister \r\n");
        result = CY_RSLT_WCM_BAD_ARG;
        goto exit;
    }
    else
    {
        /* Remove the callback from the list if it exists */
        for (i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++)
        {
            if (virtual_wcm_event_handler[i] == event_callback)
            {
                virtual_wcm_event_handler[i] = NULL;
                result = CY_RSLT_SUCCESS;
                break;
            }
        }

        if (i == CY_WCM_MAXIMUM_CALLBACKS_COUNT)
        {
            /* If i == CY_WCM_MAXIMUM_CALLBACKS_COUNT then the callback pointer does not exist in the list */
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to find callback to deregister \r\n");
            result = CY_RSLT_WCM_BAD_ARG;
            goto exit;
        }
        else
        {
            /* Check if the list is empty after removing the callback */
            for (i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++)
            {
                if (virtual_wcm_event_handler[i] != NULL)
                {
                    break;
                }
            }
            /* If i == CY_WCM_MAXIMUM_CALLBACKS_COUNT then the list is empty. So de-register the callback */
            if (i == CY_WCM_MAXIMUM_CALLBACKS_COUNT)
            {
                result = deregister_virtual_wcm_event_handler();
            }
        }
    }

exit:
    if (cy_rtos_set_mutex(&event_handler_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)result);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Releasing Mutex %p ", event_handler_mutex);

    return result;
}

