RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
cy_rslt_t cy_wcm_deinit(void)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    if (is_wcm_initialized == false)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    res = cy_rtos_deinit_mutex(&event_handler_mutex);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_deinit_mutex failed with Error : [0x%X] ", (unsigned int)res);
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    is_wcm_initialized = false;

    return res;
}

cy_rslt_t cy_wcm_get_whd_interface(cy_wcm_interface_t interface_type, whd_interface_t *whd_iface)
{
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_wcm_get_whd_interface is not supported on secondary core \n");
    return CY_RSLT_WCM_UNSUPPORTED_API;
}

#elif (!defined(ENABLE_MULTICORE_CONN_MW)) || (defined(ENABLE_MULTICORE_CONN_MW) && !defined(USE_VIRTUAL_API))
/* This section is full-stack implementation. */

#include "cybsp_wifi.h"
#include "cy_worker_thread.h"

#include "cy_network_mw_core.h"
#include "cy_chip_constants.h"

/* Wi-Fi Host driver includes. */
#include "whd_wifi_api.h"
#include "whd_network_types.h"
#include "whd_buffer_api.h"
#include "whd_wlioctl.h"
#include "whd_types.h"

#include "whd_debug.h"
#include "cy_nw_helper.h"

extern cy_rslt_t wpa3_supplicant_sae_start(uint8_t *ssid, uint8_t ssid_len, uint8_t *passphrase, uint8_t passphrase_len);
/**
 *  Macro for comparing MAC addresses
 */
#define CMP_MAC( a, b )  (((((unsigned char*)a)[0])==(((unsigned char*)b)[0]))&& \
                          ((((unsigned char*)a)[1])==(((unsigned char*)b)[1]))&& \
                          ((((unsigned char*)a)[2])==(((unsigned char*)b)[2]))&& \
                          ((((unsigned char*)a)[3])==(((unsigned char*)b)[3]))&& \
                          ((((unsigned char*)a)[4])==(((unsigned char*)b)[4]))&& \
                          ((((unsigned char*)a)[5])==(((unsigned char*)b)[5])))


/**
 *  Macro for checking for NULL MAC addresses
 */
#define NULL_MAC(a)  ( ( ( ( (unsigned char *)a )[0] ) == 0 ) && \
                       ( ( ( (unsigned char *)a )[1] ) == 0 ) && \
                       ( ( ( (unsigned char *)a )[2] ) == 0 ) && \
                       ( ( ( (unsigned char *)a )[3] ) == 0 ) && \
                       ( ( ( (unsigned char *)a )[4] ) == 0 ) && \
                       ( ( ( (unsigned char *)a )[5] ) == 0 ) )


#define CY_WCM_MAX_MUTEX_WAIT_TIME_MS               (120000)
#define CY_WCM_INTERFACE_TYPE_UNKNOWN               (4)
#define CY_WCM_DEFAULT_STA_CHANNEL                  (0)
#define WCM_WORKER_THREAD_PRIORITY                  (CY_RTOS_PRIORITY_ABOVENORMAL)
#ifndef WCM_WORKER_THREAD_STACK_SIZE
    #define WCM_WORKER_THREAD_STACK_SIZE                (10 * 1024)
#endif
#define WCM_HANDSHAKE_TIMEOUT_MS                    (3000)
#define WLC_EVENT_MSG_LINK                          (0x01)
#define JOIN_RETRY_ATTEMPTS                         (3)
#define DEFAULT_RETRY_BACKOFF_TIMEOUT_IN_MS         (1000)
#define MAX_RETRY_BACKOFF_TIMEOUT_IN_MS             (DEFAULT_RETRY_BACKOFF_TIMEOUT_IN_MS * 32)
#define DHCP_TIMEOUT_COUNT                          (6000) /* 6000 times */
#define UNKNOWN_BAND_WIDTH                          (0)
#define ARP_WAIT_TIME_IN_MSEC                       (30000)
#define ARP_CACHE_CHECK_INTERVAL_IN_MSEC            (5)
#define PING_ID                                     (0xAFAF)  /** ICMP Identifier for PING */
#define PING_DATA_SIZE                              (64)      /** ping additional data size to include in the packet */
#define MAX_WHD_INTERFACE                           (2)
#define MAX_STA_CLIENTS                             (3)
#define TX_BIT_RATE_CONVERTER                       (500)
#define PING_IF_NAME_LEN                            (6)
#define PING_RESPONSE_LEN                           (64)
#define SCAN_BSSID_ARR_LENGTH                       (50)
#define MAX_SCAN_RETRY                              (20)

/* Macro for 43012 statistics */
#define WL_CNT_VER_30                               (30)
#define WL_CNT_VER_10                               (10)
#define CHK_CNTBUF_DATALEN(cntbuf, ioctl_buflen) do { \
if (((wl_cnt_info_t *)cntbuf)->datalen + \
OFFSETOF(wl_cnt_info_t, data) > ioctl_buflen) \
printf("%s: IOVAR buffer short!\n", __FUNCTION__); \
} while (0)

#define NEVER_TIMEOUT                              ((uint32_t) 0xFFFFFFFF)
#define MAX_SEMA_COUNT                             (1)
#define XTLV_OPTION_ALIGN32                        0x0001 /* 32bit alignment of type.len.data */
#define XTLV_OPTION_IDU8                           0x0002 /* shorter id */
#define XTLV_OPTION_LENU8                          0x0004 /* shorted length */
#define WCM_ALIGN_SIZE(size, boundary) (((size) + (boundary) - 1) \
                                             & ~((boundary) - 1))
#define OFFSETOF(type, member)  ( (uintptr_t)&( (type *)0 )->member )
#define _LTOH16_UA(cp) ((cp)[0] | ((cp)[1] << 8))

/* TWT definitions */
#define CY_WCM_TWT_SETUP_CMD                        TWT_SETUP_CMD_SUGGEST_TWT
#define CY_WCM_TWT_WAKE_DURATION_DEAFULT            (8)
#define CY_WCM_TWT_WAKE_DURATION_IDLE_PROF_5G_6G    (2)
#define CY_WCM_TWT_WAKE_DURATION_ACTIVE_PROF        (31)

#define CY_WCM_TWT_MANTISSA                         (600)
#define CY_WCM_TWT_EXPONENT                         (10)

#define CY_WCM_TWT_MANTISSA_ACTIVE_PROF             (50000)
#define CY_WCM_TWT_EXPONENT_ACTIVE_PROF             (0)


/******************************************************
 *             Structures
 ******************************************************/
typedef struct
{
    cy_wcm_scan_result_callback_t p_scan_calback;       /* Callback handler to be invoked to inform caller */
    void                         *user_data;            /* Argument to be passed back to the user while invoking the callback */
    whd_scan_result_t             scan_res;             /* Scan result */
    whd_scan_status_t             scan_status;          /* Scan status */
    cy_wcm_scan_filter_t          scan_filter;          /* Scan filtering type */
    bool                          is_scanning;          /* Indicates if scanning is ongoing */
    bool                          is_stop_scan_req;     /* Indicates if stop scan was requested */
    bool                          get_security_type;    /* Indicates if cy_wcm_connect_ap is trying to find the security type */
} wcm_internal_scan_t;

