RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
/* Offload Manager de-init called once STA disconnect with AP
 *
 * @param[in] olm: olm instance
 */
CYPRESS_WEAK void cy_olm_deinit_ols(void *olm)
{
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "%s \n", __func__);
}

/*
 *  Offload Manager initialization.
 *
 *  @param[in] olm : olm instance
 *
 *  @param[in] whd : whd_interface_t
 *
 *  @param[in] ip  : pointer to ipv4 address
 *
 *  @return @ref CY_RSLT_SUCCESS if success or failure code
 *
 */

CYPRESS_WEAK cy_rslt_t cy_olm_init_ols(void *olm, void *whd, void *ip)
{
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "%s \n", __func__);
    return CY_RSLT_SUCCESS;
}

/*
 * Function returns the Offload Manager instance
 *
 *  @return olm: olm pointer
 *
 */
CYPRESS_WEAK void *cy_get_olm_instance(void)
{
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "%s \n", __func__);
    return NULL;
}

/*
 *  Function for starting WPA3 EXT SAE supplicant
 */
CYPRESS_WEAK cy_rslt_t wpa3_supplicant_sae_start(uint8_t *ssid, uint8_t ssid_len, uint8_t *passphrase, uint8_t passphrase_len)
{
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "%s \n", __func__);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_init(cy_wcm_config_t *config)
{
    cy_worker_thread_params_t params;
    cy_rslt_t res = CY_RSLT_SUCCESS;

    if ((config == NULL) ||
            ((config->interface != CY_WCM_INTERFACE_TYPE_AP_STA) && (config->interface  != CY_WCM_INTERFACE_TYPE_STA) && (config->interface != CY_WCM_INTERFACE_TYPE_AP)))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : WCM init failed due to bad arguments \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    if (is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "WCM is already initialized \n");
        return CY_RSLT_SUCCESS;
    }

    /** Initialize network stack **/
    if (!is_tcp_initialized)
    {
        res = cy_network_init();
        if (res != CY_RSLT_SUCCESS)
        {
            return CY_RSLT_WCM_NW_INIT_ERROR;
        }
        is_tcp_initialized = true;
    }

    if (cy_rtos_init_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    /* Initialize semaphore */
    if (cy_rtos_init_semaphore(&stop_scan_semaphore, MAX_SEMA_COUNT, 0) != CY_RSLT_SUCCESS)
    {
        cy_rtos_deinit_mutex(&wcm_mutex);
        return CY_RSLT_WCM_SEMAPHORE_ERROR;
    }

    if (cy_rtos_init_semaphore(&security_type_start_scan_semaphore, MAX_SEMA_COUNT, 0) != CY_RSLT_SUCCESS)
    {
        cy_rtos_deinit_semaphore(&stop_scan_semaphore);
        cy_rtos_deinit_mutex(&wcm_mutex);
        return CY_RSLT_WCM_SEMAPHORE_ERROR;
    }


    if ((res = init_whd_wifi_interface(config)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : Initializing Wi-Fi interface \n");
        cy_rtos_deinit_semaphore(&security_type_start_scan_semaphore);
        cy_rtos_deinit_semaphore(&stop_scan_semaphore);
        cy_rtos_deinit_mutex(&wcm_mutex);
        return res;
    }

    memset(&params, 0, sizeof(params));
    params.name = "WCM- Worker";
    params.priority = WCM_WORKER_THREAD_PRIORITY;
    params.stack = NULL;
    params.stack_size = WCM_WORKER_THREAD_STACK_SIZE;
    params.num_entries = 0;
    /* create a worker thread */
    if (cy_worker_thread_create(&cy_wcm_worker_thread, &params) != CY_RSLT_SUCCESS)
    {
        cy_rtos_deinit_semaphore(&security_type_start_scan_semaphore);
        cy_rtos_deinit_semaphore(&stop_scan_semaphore);
        cy_rtos_deinit_mutex(&wcm_mutex);
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    if (config->interface != CY_WCM_INTERFACE_TYPE_AP)
    {
        cy_rtos_init_timer(&sta_handshake_timer, CY_TIMER_TYPE_ONCE, handshake_timeout_handler, 0);
        cy_rtos_init_timer(&sta_retry_timer, CY_TIMER_TYPE_ONCE, hanshake_retry_timer, 0);
        scan_handler.is_scanning = false;
        olm_instance = cy_get_olm_instance();
        if (olm_instance != NULL)
        {
            /* Offload Manager create used only for STA interface
             * not required for Soft AP interface
             */
            cy_olm_create(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], NULL);
        }
        else
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Off loads not configured \n");
        }
        /* Register to ip change callback from LwIP, all other internal callbacks are in WCM */
        cy_network_register_ip_change_cb(nw_sta_if_ctx, lwip_ip_change_callback, NULL);
    }

    memset(wcm_event_handler, 0, sizeof(wcm_event_handler));
    current_interface = config->interface;
    is_wcm_initalized = true;
    return res;
}

cy_rslt_t cy_wcm_deinit()
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    /** Check if there are any active connections and disconnect **/
    if ((res = cy_wcm_disconnect_ap()) != CY_RSLT_SUCCESS)
    {
        wcm_sta_link_up = false;
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error while disconnecting  \n");
        res = CY_RSLT_WCM_STA_DISCONNECT_ERROR;
    }

    if ((res = cy_wcm_stop_scan()) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error while stopping scan  \n");
    }

    if ((res = cy_wcm_stop_ap()) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error while stopping AP \n");
    }

    if ((res = cy_rtos_deinit_semaphore(&stop_scan_semaphore)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error while de initializing stop_scan_semaphore semaphore \n");
    }

    if ((res = cy_rtos_deinit_semaphore(&security_type_start_scan_semaphore)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error while de initializing security_type_start_scan_semaphore semaphore \n");
    }


    if ((res = cy_rtos_deinit_mutex(&wcm_mutex)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error while de initializing mutex \n");
    }

