RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
    if (current_interface != CY_WCM_INTERFACE_TYPE_AP_STA)
    {
        if ((res = cybsp_wifi_deinit(whd_ifs[current_interface])) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in bringing down the interface \n");
        }
    }
    else
    {
        /* In concurrent bringing down AP interface, followed by STA interface */
        if ((res = whd_deinit(whd_ifs[CY_WCM_INTERFACE_TYPE_AP])) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in bringing down AP interface \n");
        }

        if ((res = cybsp_wifi_deinit(whd_ifs[CY_WCM_INTERFACE_TYPE_STA])) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in bringing down STA interface \n");
        }
    }

    if (current_interface != CY_WCM_INTERFACE_TYPE_AP)
    {
        cy_rtos_deinit_timer(&sta_handshake_timer);
        cy_rtos_deinit_timer(&sta_retry_timer);
        retry_backoff_timeout = DEFAULT_RETRY_BACKOFF_TIMEOUT_IN_MS;
    }
    cy_worker_thread_delete(&cy_wcm_worker_thread);
    is_wcm_initalized = false;

    return res;
}

cy_rslt_t cy_wcm_start_scan(cy_wcm_scan_result_callback_t callback, void *user_data, cy_wcm_scan_filter_t *scan_filter)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    whd_ssid_t *ssid = NULL;
    whd_mac_t *mac = NULL;
    uint32_t band;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if (callback == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if (cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    if (scan_handler.get_security_type)
    {
        res = CY_RSLT_WCM_CONNECT_IN_PROGRESS;
        goto exit;
    }

    if (scan_handler.is_scanning)
    {
        res = CY_RSLT_WCM_SCAN_IN_PROGRESS;
        goto exit;
    }

    /* Reset mac_addr_arr before each scan and set current_bssid_arr_length to 0 */
    mac_addr_arr = (whd_mac_t *)malloc(SCAN_BSSID_ARR_LENGTH * sizeof(whd_mac_t));
    if (mac_addr_arr == NULL)
    {
        res = CY_RSLT_WCM_OUT_OF_MEMORY;
        goto exit;
    }
    current_bssid_arr_length = 0;

    /* reset previous filter and by default set band to AUTO */
    memset(&scan_handler.scan_filter, 0, sizeof(cy_wcm_scan_filter_t));
    whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_AUTO);

    /* Store the scan callback and user data */
    scan_handler.p_scan_calback = callback;
    scan_handler.user_data = user_data;
    if (scan_filter != NULL)
    {
        /** copy the filter setting to reuse in the internal scan handler **/
        memcpy(&scan_handler.scan_filter, scan_filter, sizeof(cy_wcm_scan_filter_t));
        switch (scan_filter->mode)
        {
        case CY_WCM_SCAN_FILTER_TYPE_SSID:
            /** Copy the SSID **/
            ssid = (whd_ssid_t*)malloc(sizeof(whd_ssid_t));
            if (ssid == NULL)
            {
                res =  CY_RSLT_WCM_OUT_OF_MEMORY;
                goto exit;
            }
            ssid->length = strlen((char*)scan_filter->param.SSID);
            memcpy(ssid->value, scan_filter->param.SSID, ssid->length + 1);
            break;
        case CY_WCM_SCAN_FILTER_TYPE_MAC:
            /** Copy the MAC **/
            mac = (whd_mac_t*)malloc(sizeof(whd_mac_t));
            if (mac == NULL)
            {
                res =  CY_RSLT_WCM_OUT_OF_MEMORY;
                goto exit;
            }
            memcpy(mac->octet, scan_filter->param.BSSID, CY_WCM_MAC_ADDR_LEN);
            break;
        case CY_WCM_SCAN_FILTER_TYPE_BAND:
            /* check if the platform supports the requested band */
            if (!check_if_platform_supports_band(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], scan_filter->param.band))
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "band not supported \n");
                res = CY_RSLT_WCM_BAND_NOT_SUPPORTED;
                goto exit;
            }
            if (scan_filter->param.band == CY_WCM_WIFI_BAND_5GHZ)
            {
                band = WLC_BAND_5G;
            }
            else if (scan_filter->param.band == CY_WCM_WIFI_BAND_2_4GHZ)
            {
                band = WLC_BAND_2G;
            }
            else if (scan_filter->param.band == CY_WCM_WIFI_BAND_6GHZ)
            {
                band = WLC_BAND_6G;
            }
            else
            {
                band = WLC_BAND_AUTO;
            }
            whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, band);
            break;
        case CY_WCM_SCAN_FILTER_TYPE_RSSI:
            /**
            * Do nothing, the scan filter is copied into scan_handler
            * which will be used in worker thread to process the received RSSI
            */
            break;
        default:
            break;
        }
    }

    res = whd_wifi_scan(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WHD_SCAN_TYPE_ACTIVE, WHD_BSS_TYPE_ANY,
                        ssid, mac, NULL, NULL, internal_scan_callback, &scan_result, user_data);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_scan error. Result = %d \n", res);
        res = CY_RSLT_WCM_SCAN_ERROR;
        goto exit;
    }
    scan_handler.is_scanning = true;
    scan_handler.is_stop_scan_req = false;

exit:
    /* Free the allocated memory in case of SSID or MAC based scan */
    if (ssid != NULL)
    {
        free(ssid);
        ssid = NULL;
    }
    if (mac != NULL)
    {
        free(mac);
        mac = NULL;
    }
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}

