RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
cy_rslt_t cy_wcm_stop_scan()
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    bool wait_on_sema = false;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if (cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    if (scan_handler.get_security_type)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_wcm_connect_ap has initiated an internal scan to find the security type of AP. No active user scan running. \n");
        res =  CY_RSLT_WCM_CONNECT_IN_PROGRESS;
        goto exit;
    }

    if (!scan_handler.is_scanning)
    {
        res =  CY_RSLT_WCM_NO_ACTIVE_SCAN;
        goto exit;
    }

    if ((res = whd_wifi_stop_scan(whd_ifs[CY_WCM_INTERFACE_TYPE_STA]) != CY_RSLT_SUCCESS))
    {
        res = CY_RSLT_WCM_STOP_SCAN_ERROR;
        goto exit;
    }
    scan_handler.is_stop_scan_req = true;
    wait_on_sema = true;

exit:
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    if (wait_on_sema)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wait on stop scan semaphore %s %d\r\n", __FILE__, __LINE__);
        if (cy_rtos_get_semaphore(&stop_scan_semaphore, NEVER_TIMEOUT, false) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error unable to get semaphore \n");
            res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_SEMAPHORE_ERROR);
        }
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "obtained stop scan semaphore %s %d\r\n", __FILE__, __LINE__);
    }

    return res;
}

cy_rslt_t cy_wcm_register_event_callback(cy_wcm_event_callback_t event_callback)
{
    uint8_t i;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if (event_callback == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments to cy_wcm_register_event_callback(). \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n wcm_mutex - Acquiring Mutex %p ", wcm_mutex);
    result = cy_rtos_get_mutex(&wcm_mutex, CY_RTOS_NEVER_TIMEOUT);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] ", wcm_mutex, (unsigned int)result);
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    for (i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++)
    {
        if (wcm_event_handler[i] == NULL)
        {
            wcm_event_handler[i] = event_callback;
            break;
        }
    }

    if (i == CY_WCM_MAXIMUM_CALLBACKS_COUNT)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Out of CY_WCM_MAXIMUM_CALLBACKS_COUNT \r\n");
        result = CY_RSLT_WCM_OUT_OF_MEMORY;
        goto exit;
    }

exit:
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] ", wcm_mutex, (unsigned int)result);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n wcm_mutex - Releasing Mutex %p ", wcm_mutex);

    return result;
}

cy_rslt_t cy_wcm_deregister_event_callback(cy_wcm_event_callback_t event_callback)
{
    uint8_t i;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if (event_callback == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments to cy_wcm_register_event_callback(). \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n wcm_mutex - Acquiring Mutex %p ", wcm_mutex);
    result = cy_rtos_get_mutex(&wcm_mutex, CY_RTOS_NEVER_TIMEOUT);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] ", wcm_mutex, (unsigned int)result);
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    for (i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++)
    {
        if (wcm_event_handler[i] == event_callback)
        {
            memset(&wcm_event_handler[i], 0, sizeof(cy_wcm_event_callback_t));
            break;
        }
    }

    if (i == CY_WCM_MAXIMUM_CALLBACKS_COUNT)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to find callback to deregister \r\n");
        result = CY_RSLT_WCM_BAD_ARG;
        goto exit;
    }

exit:
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] ", wcm_mutex, (unsigned int)result);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n wcm_mutex - Releasing Mutex %p ", wcm_mutex);

    return result;
}

/* whd scan callback to find the security type when user has not
 * provided the security type to cy_wcm_connect_ap
 */
static void internal_scan_cb_get_security_type(whd_scan_result_t **result_ptr, void *user_data, whd_scan_status_t status)
{
    if (status == WHD_SCAN_ABORTED)
    {
        return;
    }
    if (status == WHD_SCAN_COMPLETED_SUCCESSFULLY)
    {
        goto exit;
    }
    else if (status == WHD_SCAN_INCOMPLETE)
    {
        if ((**result_ptr).SSID.length != 0)
        {
            cy_wcm_connect_params_t *connect_params = (cy_wcm_connect_params_t *)user_data;

            if (strcmp((char *)(**result_ptr).SSID.value, (char *)connect_params->ap_credentials.SSID) != 0)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Scanned SSID did not match SSID passed by user \n");
                return;
            }
            if (connect_params->ap_credentials.security == CY_WCM_SECURITY_UNKNOWN)
            {
                connect_params->ap_credentials.security = whd_to_wcm_security((**result_ptr).security);
            }
        }
    }

