RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
            if (connect_params->itwt_profile != CY_WCM_ITWT_PROFILE_NONE)
            {
                wl_bss_info_t  bss_info;

                /* iTWT parameter values are based on the band, so first get the band */
                res = whd_wifi_get_bss_info(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &bss_info);
                if (res == CY_RSLT_SUCCESS)
                {
                    uint8_t band = 0;
                    whd_itwt_setup_params_t twt_params;

                    twt_params.setup_cmd     = CY_WCM_TWT_SETUP_CMD;
                    twt_params.trigger       = true;
                    twt_params.flow_type     = true;
                    twt_params.flow_id       = 0;
                    twt_params.wake_duration = CY_WCM_TWT_WAKE_DURATION_DEAFULT;
                    twt_params.exponent      = CY_WCM_TWT_EXPONENT;
                    twt_params.mantissa      = CY_WCM_TWT_MANTISSA;
                    twt_params.wake_time_h   = 0;
                    twt_params.wake_time_l   = 0;

                    band = (bss_info.chanspec & 0xC000) >> 8;
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "band : [0x%X]\n", band);

                    if (connect_params->itwt_profile == CY_WCM_ITWT_PROFILE_IDLE)
                    {
                        if ((band == WCM_WIFI_CHANSPEC_5GHZ) || (band == WCM_WIFI_CHANSPEC_6GHZ))
                        {
                            twt_params.wake_duration = CY_WCM_TWT_WAKE_DURATION_IDLE_PROF_5G_6G;
                        }
                    }
                    else if (connect_params->itwt_profile == CY_WCM_ITWT_PROFILE_ACTIVE)
                    {
                        twt_params.wake_duration = CY_WCM_TWT_WAKE_DURATION_ACTIVE_PROF;
                        twt_params.exponent      = CY_WCM_TWT_EXPONENT_ACTIVE_PROF;
                        twt_params.mantissa      = CY_WCM_TWT_MANTISSA_ACTIVE_PROF;
                    }
                    res = whd_wifi_itwt_setup(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &twt_params);
                    if (res != CY_RSLT_SUCCESS)
                    {
                        if (res == WHD_WLAN_UNSUPPORTED)
                        {
                            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "iTWT Not supported for this capabilities\n");
                        }

                        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_itwt_setup failed %x\r\n", res);
                    }
                }
            }
            /* save current AP credentials to reuse during retry in case handshake fails occurs */
            connected_ap_details.security = security;
            connected_ap_details.SSID.length = ssid.length;
            connected_ap_details.keylen = keylen;
            connected_ap_details.band = connect_params->band;
            memcpy(connected_ap_details.key, key, keylen + 1);
            memcpy(connected_ap_details.SSID.value, ssid.value, connected_ap_details.SSID.length + 1);
            memcpy(connected_ap_details.sta_mac.octet, bssid.octet, CY_WCM_MAC_ADDR_LEN);
            memcpy(&connected_ap_details.static_ip, &static_ip, sizeof(static_ip));
            wcm_sta_link_up = true;
            connection_status = CY_WCM_EVENT_CONNECTED;
            if ((res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status)) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
                goto exit;
            }
            /* post IP change callback */
            if ((res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_ip_change, NULL)) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : Failed to notify IP change. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
                goto exit;
            }
        }
    }
    else
    {
        res = CY_RSLT_WCM_WAIT_TIMEOUT;
        connection_status = CY_WCM_EVENT_CONNECT_FAILED;
        if (cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
        }
    }

exit:
    is_connect_triggered = false;
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Mutex release error \n");
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}

cy_rslt_t cy_wcm_disconnect_ap()
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if (cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    /* Deregister the link event handler */
    whd_wifi_deregister_event_handler(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], sta_event_handler_index);
    network_down(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], CY_NETWORK_WIFI_STA_INTERFACE);
    res = whd_wifi_leave(whd_ifs[CY_WCM_INTERFACE_TYPE_STA]);
    if (res != CY_RSLT_SUCCESS)
    {
        goto exit;
    }
    wcm_sta_link_up = false;

    /* Call Offload deinit after disconnect to AP */
    if ((is_olm_initialized == true) && (olm_instance != NULL))
    {
        cy_olm_deinit_ols(olm_instance);
        is_olm_initialized = false;
    }

