RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
static int xtlv_id(const xtlv_t *elt, xtlv_opts_t opts)
{
    int id = 0;
    if (opts & XTLV_OPTION_IDU8)
    {
        id =  *(const uint8_t *)elt;
    }
    else
    {
        id = ltoh16_ua((const uint8_t *)elt);
    }
    return id;
}

static int xtlv_hdr_size(xtlv_opts_t opts, const uint8_t **data)
{
    int len = (int)OFFSETOF(xtlv_t, data); /* nominal */
    if (opts & XTLV_OPTION_LENU8)
    {
        --len;
    }
    if (opts & XTLV_OPTION_IDU8)
    {
        --len;
    }
    return len;
}

static void xtlv_unpack_xtlv(const xtlv_t *xtlv, uint16_t *type, uint16_t *len,
                             const uint8_t **data, xtlv_opts_t opts)
{
    if (type)
    {
        *type = (uint16_t)xtlv_id(xtlv, opts);
    }
    if (len)
    {
        *len = (uint16_t)xtlv_len(xtlv, opts);
    }
    if (data)
    {
        *data = (const uint8_t *)xtlv + xtlv_hdr_size(opts, data);
    }
}

static void unpack_xtlv_buf(const uint8_t *tlv_buf, uint16_t buflen, cy_wcm_wlan_statistics_t *stat)
{
    uint16_t len;
    uint16_t type;
    int size;
    const xtlv_t *ptlv;
    int sbuflen = buflen;
    const uint8_t *data;
    int hdr_size;

    hdr_size = xtlv_hdr_size(XTLV_OPTION_ALIGN32, &data);
    while (sbuflen >= hdr_size)
    {
        ptlv = (const xtlv_t *)tlv_buf;

        xtlv_unpack_xtlv(ptlv, &type, &len, &data, XTLV_OPTION_ALIGN32);
        size = xtlv_size_for_data(len, XTLV_OPTION_ALIGN32, &data);

        sbuflen -= size;
        if (sbuflen < 0) /* check for buffer overrun */
        {
            break;
        }
        if (type == 0x100)
        {
            if (wl_counters(data, stat) == CY_RSLT_SUCCESS)
            {
                break;
            }
        }
        tlv_buf += size;
    }
    return;
}

static cy_rslt_t wl_counters(const uint8_t *data, cy_wcm_wlan_statistics_t *stat)
{
    wl_cnt_ver_30_t *cnt = (wl_cnt_ver_30_t *)data;
    stat->rx_bytes   = cnt->rxbyte;
    stat->tx_bytes   = cnt->txbyte;
    stat->rx_packets = cnt->rxfrag;
    stat->tx_packets = cnt->txfrag;
    stat->tx_failed  = cnt->txfail;
    stat->tx_retries = cnt->txretry;
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_get_wlan_statistics(cy_wcm_interface_t interface, cy_wcm_wlan_statistics_t *stat)
{
    uint32_t data_rate;
    wl_cnt_ver_ten_t *received_counters;
    uint8_t buffer[WLC_IOCTL_MEDLEN];
    wl_cnt_info_t *wl_cnt_info ;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if (interface != CY_WCM_INTERFACE_TYPE_STA)
    {
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if (stat == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    CHECK_RETURN(whd_wifi_get_iovar_buffer(whd_ifs[ CY_WCM_INTERFACE_TYPE_STA], IOVAR_STR_COUNTERS, buffer, WLC_IOCTL_MEDLEN));
    wl_cnt_info = (wl_cnt_info_t *)buffer;

    if (wl_cnt_info->version == WL_CNT_VER_30)
    {
        /* 43012 board - Process xtlv buffer data to get statistics */
        uint8_t *cntdata;
        cntdata = (uint8_t *)malloc(wl_cnt_info->datalen);

        CHK_CNTBUF_DATALEN(wl_cnt_info, WLC_IOCTL_MEDLEN);
        if (cntdata == NULL)
        {
            return CY_RSLT_TYPE_ERROR;
        }
        memcpy(cntdata, wl_cnt_info->data, wl_cnt_info->datalen);
        unpack_xtlv_buf(cntdata, wl_cnt_info->datalen, stat);
        free(cntdata);
    }
    else if (wl_cnt_info->version == WL_CNT_VER_10)
    {
        received_counters = (wl_cnt_ver_ten_t*)  wl_cnt_info;

        /* Copy the required statistics */
        stat->rx_bytes   = received_counters->rxbyte;
        stat->tx_bytes   = received_counters->txbyte;
        stat->rx_packets = received_counters->rxfrag;
        stat->tx_packets = received_counters->txfrag;
        stat->tx_failed  = received_counters->txfail;
        stat->tx_retries = received_counters->txretry;
    }

    /* get data rate */
    CHECK_RETURN(whd_wifi_get_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_GET_RATE, &data_rate));
    /* The data rate received is in units of 500Kbits per sec, convert to Kbits per sec*/
    stat->tx_bitrate = (data_rate * TX_BIT_RATE_CONVERTER);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_get_gateway_mac_address(cy_wcm_mac_t *mac_addr)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_nw_ip_mac_t nw_mac_addr;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if (mac_addr == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    if (current_interface == CY_WCM_INTERFACE_TYPE_AP)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "feature not supported for AP interface \r\n");
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if (!is_sta_network_up)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
        return CY_RSLT_WCM_NETIF_DOES_NOT_EXIST;
    }

    memset(mac_addr, 0, sizeof(*mac_addr));
    res = cy_network_get_gateway_mac_address(nw_sta_if_ctx, &nw_mac_addr);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the Gateway MAC address\n");
        res = CY_RSLT_WCM_GATEWAY_MAC_ADDR_ERROR;
    }
    (*mac_addr)[0] = nw_mac_addr.mac[0];
    (*mac_addr)[1] = nw_mac_addr.mac[1];
    (*mac_addr)[2] = nw_mac_addr.mac[2];
    (*mac_addr)[3] = nw_mac_addr.mac[3];
    (*mac_addr)[4] = nw_mac_addr.mac[4];
    (*mac_addr)[5] = nw_mac_addr.mac[5];
    return res;
}

cy_rslt_t cy_wcm_ping(cy_wcm_interface_t interface, cy_wcm_ip_address_t* address, uint32_t timeout_ms, uint32_t* elapsed_time_ms)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if ((interface != CY_WCM_INTERFACE_TYPE_STA) && (interface != CY_WCM_INTERFACE_TYPE_AP))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "interface not supported \r\n");
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

