RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
    if ((address == NULL) || (elapsed_time_ms == NULL))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "BAD arguments \r\n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    if ((interface == CY_WCM_INTERFACE_TYPE_STA) && (wcm_sta_link_up == false))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "STA network down \r\n");
        return CY_RSLT_WCM_STA_NETWORK_DOWN;
    }

    if ((interface == CY_WCM_INTERFACE_TYPE_AP) && (is_soft_ap_up == false))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "AP not up \r\n");
        return CY_RSLT_WCM_AP_NOT_UP;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if (cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    /* Call cy_network_ping() */
    if (interface == CY_WCM_INTERFACE_TYPE_AP)
    {
        res = cy_network_ping((void *)nw_ap_if_ctx, (cy_nw_ip_address_t *) address, timeout_ms, elapsed_time_ms);
    }
    else
    {
        res = cy_network_ping((void *)nw_sta_if_ctx, (cy_nw_ip_address_t *) address, timeout_ms, elapsed_time_ms);
    }

    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release the mutex \n");
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}

cy_rslt_t cy_wcm_start_ap(const cy_wcm_ap_config_t *ap_config)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    whd_ssid_t ssid;
    uint8_t *key;
    uint8_t keylen;
    uint16_t chanspec = 0;
    whd_security_t security;
    cy_network_static_ip_addr_t static_ip;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if ((res = check_soft_ap_config(ap_config)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad soft ap config \n");
        return res;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if (cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    if (is_soft_ap_up)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "AP is already Up !!\n");
        res = CY_RSLT_WCM_AP_ALREADY_UP;
        goto exit;
    }

    read_ap_config(ap_config, &ssid, &key, &keylen, &security, &static_ip);
    /* Store the SoftAP security type */
    ap_security = whd_to_wcm_security(security);

    /* Construct chanspec from band and channel number */
    if (ap_config->band == CY_WCM_WIFI_BAND_5GHZ)
    {
        chanspec = WCM_WIFI_CHANSPEC_5GHZ;
    }
    else if (ap_config->band == CY_WCM_WIFI_BAND_6GHZ)
    {
        chanspec = WCM_WIFI_CHANSPEC_6GHZ;
    }
    else
    {
        /* 2.4 GHz band */
        chanspec = WCM_WIFI_CHANSPEC_2_4GHZ;
    }

    /* Add channel info */
    chanspec = ((chanspec << 8) | ap_config->channel);

    /* set up the AP info */
    res = whd_wifi_init_ap(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], &ssid, security, (const uint8_t *)key,
                           keylen, chanspec);

    if (res != CY_RSLT_SUCCESS)
    {
        if (res == WHD_UNSUPPORTED || res == WHD_WEP_NOT_ALLOWED)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Security type not supported, result = %d \n", res);
            res = CY_RSLT_WCM_SECURITY_NOT_SUPPORTED;
        }
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "ERROR initializing AP = %d \n", res);
        goto exit;
    }

    if (ap_config->ie_info)
    {
        res = whd_wifi_manage_custom_ie(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], WHD_ADD_CUSTOM_IE, (const uint8_t *)ap_config->ie_info->oui,
                                        ap_config->ie_info->subtype, (const void *)ap_config->ie_info->data, ap_config->ie_info->length, ap_config->ie_info->ie_packet_mask);
        if (res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "ERROR while adding Custom IE = %d\n", res);
            goto exit;
        }
    }

    res = whd_wifi_start_ap(whd_ifs[CY_WCM_INTERFACE_TYPE_AP]);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "unable to start AP \n");
        goto exit;
    }

    if ((res = network_up(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], CY_NETWORK_WIFI_AP_INTERFACE, &static_ip)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to bring up the network stack\n");
        res = CY_RSLT_WCM_STA_NETWORK_DOWN;
        /* stop the AP, stopping of AP will remove custom IE */
        whd_wifi_stop_ap(whd_ifs[CY_WCM_INTERFACE_TYPE_AP]);
        goto exit;
    }

    /* Register for AP Link events*/
    if ((res = whd_management_set_event_handler(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], ap_link_events, ap_link_events_handler, NULL, &ap_event_handler_index)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to set the Event handler \n");
        network_down(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], CY_NETWORK_WIFI_AP_INTERFACE);
        whd_wifi_stop_ap(whd_ifs[CY_WCM_INTERFACE_TYPE_AP]);
        goto exit;
    }
    is_soft_ap_up = true;

exit:
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release the mutex \n");
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}

cy_rslt_t cy_wcm_stop_ap(void)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if (cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

