RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
    if (is_soft_ap_up)
    {
        network_down(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], CY_NETWORK_WIFI_AP_INTERFACE);
        /* De-register of AP link event handler */
        whd_wifi_deregister_event_handler(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], ap_event_handler_index);
        res = whd_wifi_stop_ap(whd_ifs[CY_WCM_INTERFACE_TYPE_AP]);
        if (res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WHD stop ap failed \n");
            goto exit;
        }
        is_soft_ap_up = false;
    }
exit:
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}


cy_rslt_t cy_wcm_get_associated_client_list(cy_wcm_mac_t *client_list, uint8_t num_clients)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    whd_maclist_t *mac_list_ptr;
    uint32_t      buf_length;

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if (client_list == NULL || num_clients == 0)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if (cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    if (current_interface == CY_WCM_INTERFACE_TYPE_STA)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "operation not allowed for STA Interface \n");
        res = CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
        goto exit;
    }

    if (!is_ap_network_up)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "AP is not Up !!\n");
        res = CY_RSLT_WCM_AP_NOT_UP;
        goto exit;
    }

    buf_length   = (sizeof(whd_mac_t) * num_clients) + sizeof(mac_list_ptr->count);
    mac_list_ptr = (whd_maclist_t*)malloc(buf_length);
    if (mac_list_ptr == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Heap space error \n");
        res = CY_RSLT_WCM_OUT_OF_MEMORY;
        goto exit;
    }
    memset(mac_list_ptr, 0, buf_length);
    mac_list_ptr->count = num_clients;

    if ((res = whd_wifi_get_associated_client_list(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], mac_list_ptr, buf_length)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error while getting associated client list, error = %d \n", res);
        free(mac_list_ptr);
        goto exit;
    }

    memcpy(client_list, mac_list_ptr->mac_list, (sizeof(whd_mac_t) * num_clients));
    free(mac_list_ptr);

exit:
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}

static uint16_t channel_to_bandwidth(wl_chanspec_t chanspec)
{
    uint16_t band_width;
    switch (chanspec & WL_CHANSPEC_BW_MASK)
    {
    case WL_CHANSPEC_BW_5 :
        band_width = 5;
        break;

    case WL_CHANSPEC_BW_10 :
        band_width = 10;
        break;

    case WL_CHANSPEC_BW_20 :
        band_width = 20;
        break;

    case WL_CHANSPEC_BW_40 :
        band_width = 40;
        break;

    case WL_CHANSPEC_BW_80 :
        band_width = 80;
        break;

    case WL_CHANSPEC_BW_160 :
        band_width = 160;
        break;

    case WL_CHANSPEC_BW_8080 :
        band_width = 8080;
        break;

    default :
        band_width = UNKNOWN_BAND_WIDTH;
        break;
    }
    return band_width;
}

static cy_rslt_t check_ap_credentials(const cy_wcm_connect_params_t *connect_params)
{
    uint8_t ssid_len;
    uint8_t pwd_len;
    cy_wcm_security_t sec_type;

    if (connect_params == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    ssid_len = (uint8_t)strlen((char*)connect_params->ap_credentials.SSID);
    pwd_len  = (uint8_t)strlen((char*)connect_params->ap_credentials.password);

    if (ssid_len == 0 || ssid_len > CY_WCM_MAX_SSID_LEN)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "SSID length error\n");
        return CY_RSLT_WCM_BAD_SSID_LEN;
    }
    if (!check_wcm_security(connect_params->ap_credentials.security))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "AP credentials security error\n");
        return CY_RSLT_WCM_SECURITY_NOT_SUPPORTED;
    }

    sec_type = connect_params->ap_credentials.security ;
    /* For open, owe and enterprise security auth types pwd len can be ignored */
    if (((sec_type != CY_WCM_SECURITY_OPEN) &&
#ifdef COMPONENT_WIFI6
            (sec_type != CY_WCM_SECURITY_OWE) &&
#endif
            (!check_if_ent_auth_types(sec_type))) &&
            (pwd_len < CY_WCM_MIN_PASSPHRASE_LEN || pwd_len > CY_WCM_MAX_PASSPHRASE_LEN))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "AP credentials passphrase length error. Length must be between 8 and 63\n");
        return CY_RSLT_WCM_BAD_PASSPHRASE_LEN;
    }
    return CY_RSLT_SUCCESS;
}

static cy_rslt_t convert_connect_params(const cy_wcm_connect_params_t *connect_params, whd_ssid_t *ssid, whd_mac_t *bssid,
                                        uint8_t **key, uint8_t *keylen, whd_security_t *security, cy_network_static_ip_addr_t *static_ip_addr)
{
    ssid->length = (uint8_t)strlen((char*)connect_params->ap_credentials.SSID);
    memcpy(&ssid->value, connect_params->ap_credentials.SSID, ssid->length + 1);

    *keylen = strlen((char*)connect_params->ap_credentials.password);
    *key = (uint8_t*)connect_params->ap_credentials.password;
    if (!NULL_MAC(connect_params->BSSID))
    {
        memcpy(bssid, connect_params->BSSID, CY_WCM_MAC_ADDR_LEN);
    }
    else
    {
        memset(bssid, 0, sizeof(whd_mac_t));
    }
    *security = wcm_to_whd_security(connect_params->ap_credentials.security);
    if (connect_params->static_ip_settings == NULL)
    {
        memset(static_ip_addr, 0, sizeof(cy_network_static_ip_addr_t));
    }
    else
    {
        memset(static_ip_addr, 0, sizeof(cy_network_static_ip_addr_t));
        if (connect_params->static_ip_settings->gateway.version == CY_WCM_IP_VER_V4)
        {
            static_ip_addr->gateway.ip.v4 = connect_params->static_ip_settings->gateway.ip.v4;
            static_ip_addr->addr.ip.v4    = connect_params->static_ip_settings->ip_address.ip.v4;
            static_ip_addr->netmask.ip.v4 = connect_params->static_ip_settings->netmask.ip.v4;

