RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
exit:
    free(whd_scan_res);

    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to release the WCM mutex \n");
        return;
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);
}

static void invoke_app_callbacks(cy_wcm_event_t event_type, cy_wcm_event_data_t* arg)
{
    int i = 0;

    for (i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++)
    {
        if (wcm_event_handler[i] != NULL)
        {
            wcm_event_handler[i](event_type, arg);
        }
    }
}

static void ap_callback_handler(void* arg)
{
    cy_wcm_event_data_t link_event_data;
    wcm_ap_link_event *event_data = (wcm_ap_link_event*)arg;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Notify application about AP events \n");
    memset(&link_event_data, 0, sizeof(cy_wcm_event_data_t));
    memcpy(link_event_data.sta_mac, event_data->mac_addr, CY_WCM_MAC_ADDR_LEN);
    invoke_app_callbacks(event_data->event, &link_event_data);
    free(arg);
}

static void *ap_link_events_handler(whd_interface_t ifp, const whd_event_header_t *event_header, const uint8_t *event_data, void *handler_user_data)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    UNUSED_PARAMETER(res);
    wcm_ap_link_event *ap_event_data;

    ap_event_data = (wcm_ap_link_event*)malloc(sizeof(wcm_ap_link_event));
    if (ap_event_data == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed %s %d\r\n", __FILE__, __LINE__);
        return handler_user_data;
    }

    if (event_header->event_type == WLC_E_DISASSOC_IND || event_header->event_type == WLC_E_DEAUTH_IND)
    {
#ifdef PROTO_MSGBUF
        whd_wifi_delete_peer(ifp, (uint8_t *)event_header->addr.octet);
#endif /* PROTO_MSGBUF */
        ap_event_data->event = CY_WCM_EVENT_STA_LEFT_SOFTAP;
    }
    else if (event_header->event_type == WLC_E_ASSOC_IND || event_header->event_type == WLC_E_REASSOC_IND)
    {
        /* Set ap_event_data->event only if the security type of AP is CY_WCM_SECURITY_OPEN/CY_WCM_SECURITY_WEP_PSK/CY_WCM_SECURITY_WEP_SHARED.
         * For all other security types wait for WLC_E_AUTHORIZED event to set ap_event_data->event to CY_WCM_EVENT_STA_JOINED_SOFTAP.
         */
        if (ap_security == CY_WCM_SECURITY_OPEN || ap_security == CY_WCM_SECURITY_WEP_PSK || ap_security == CY_WCM_SECURITY_WEP_SHARED)
        {
            ap_event_data->event = CY_WCM_EVENT_STA_JOINED_SOFTAP;
        }
        else
        {
            /* Ignore other security types */
            free(ap_event_data);
            return handler_user_data;
        }
    }
    else if (event_header->event_type == WLC_E_AUTHORIZED)
    {
        /* If the security type of AP is other than CY_WCM_SECURITY_OPEN, CY_WCM_SECURITY_WEP_PSK, CY_WCM_SECURITY_WEP_SHARED and
         * WLC_E_AUTHORIZED event is received, then set ap_event_data->event to CY_WCM_EVENT_STA_JOINED_SOFTAP.
         */
        if (ap_security != CY_WCM_SECURITY_OPEN && ap_security != CY_WCM_SECURITY_WEP_PSK && ap_security != CY_WCM_SECURITY_WEP_SHARED)
        {
            ap_event_data->event = CY_WCM_EVENT_STA_JOINED_SOFTAP;
        }
        else
        {
            /* Ignore other security types */
            free(ap_event_data);
            return handler_user_data;
        }
    }
    else
    {
        /* Ignore other events */
        free(ap_event_data);
        return handler_user_data;
    }

    memcpy(ap_event_data->mac_addr, event_header->addr.octet, CY_WCM_MAC_ADDR_LEN);
    if ((res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, ap_callback_handler, (void *)ap_event_data)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to handle link up event. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
        free(ap_event_data);
    }

    return handler_user_data;
}

static void *link_events_handler(whd_interface_t ifp, const whd_event_header_t *event_header, const uint8_t *event_data, void *handler_user_data)
{
    uint32_t connection_status;
    cy_rslt_t res = CY_RSLT_SUCCESS;
    UNUSED_PARAMETER(res);
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Link event (type, status, reason, flags) %u %u %u %u\n", (unsigned int)event_header->event_type, (unsigned int)event_header->status,
                   (unsigned int)event_header->reason, (unsigned int)event_header->flags);
    switch (event_header->event_type)
    {
    case WLC_E_LINK:
        if ((event_header->flags & WLC_EVENT_MSG_LINK) != 0)
        {
            switch (sta_security_type)
            {
            case WHD_SECURITY_OPEN:
            case WHD_SECURITY_IBSS_OPEN:
            case WHD_SECURITY_WPS_SECURE:
            case WHD_SECURITY_WEP_PSK:
            case WHD_SECURITY_WEP_SHARED:
            {
                /* Advertise link-up immediately as no EAPOL is required */
                link_up();
                break;
            }
            case WHD_SECURITY_WPA_TKIP_PSK:
            case WHD_SECURITY_WPA_AES_PSK:
            case WHD_SECURITY_WPA_MIXED_PSK:
            case WHD_SECURITY_WPA2_AES_PSK:
            case WHD_SECURITY_WPA2_AES_PSK_SHA256:
            case WHD_SECURITY_WPA2_TKIP_PSK:
            case WHD_SECURITY_WPA2_MIXED_PSK:
            case WHD_SECURITY_WPA2_WPA_AES_PSK:
            case WHD_SECURITY_WPA2_WPA_MIXED_PSK:
            case WHD_SECURITY_WPA_TKIP_ENT:
            case WHD_SECURITY_WPA_AES_ENT:
            case WHD_SECURITY_WPA_MIXED_ENT:
            case WHD_SECURITY_WPA2_TKIP_ENT:
            case WHD_SECURITY_WPA2_AES_ENT:
            case WHD_SECURITY_WPA2_MIXED_ENT:
            case WHD_SECURITY_WPA2_FBT_PSK:
            case WHD_SECURITY_WPA2_FBT_ENT:
            case WHD_SECURITY_WPA3_SAE:
            case WHD_SECURITY_WPA3_WPA2_PSK:
#ifdef COMPONENT_WIFI6
            case WHD_SECURITY_WPA3_OWE:
#endif
#ifdef COMPONENT_CAT5
            case WHD_SECURITY_WPA3_192BIT_ENT:
            case WHD_SECURITY_WPA3_ENT_AES_CCMP:
            case WHD_SECURITY_WPA3_ENT:
#endif
            {
                link_up_event_received = WHD_TRUE;
                /* Start a timer and wait for WLC_E_PSK_SUP event */
                cy_rtos_start_timer(&sta_handshake_timer, WCM_HANDSHAKE_TIMEOUT_MS);
                break;
            }
            case WHD_SECURITY_UNKNOWN:
            case WHD_SECURITY_FORCE_32_BIT:
            default:
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad Security type\r\n");
                break;
            }
            }
            /* Notify application connecting */
            connection_status = CY_WCM_EVENT_CONNECTING;
            if ((res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status)) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
            }
        }
        else
        {
            /* Check if the link down event is followed by too many RSN IE Error. If yes, try join again */
            if (too_many_ie_error)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Notify application that WCM will retry to connect to the AP!\n");
                invoke_app_callbacks(CY_WCM_EVENT_INITIATED_RETRY, NULL);
                /* Try to join the AP again */
                handshake_timeout_handler(0);

