RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
                /* Clear the error flag */
                too_many_ie_error = WHD_FALSE;
            }
            /* Check if the beacon is lost */
            else if (event_header->reason == WLC_E_LINK_BCN_LOSS)
            {
                link_down(event_header->reason);
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Beacon Lost notify application that WCM will retry to connect to the AP!\n");
                invoke_app_callbacks(CY_WCM_EVENT_INITIATED_RETRY, NULL);

                /* Try to join the AP again */
                handshake_timeout_handler(0);
            }
            else
            {
                /* WPA handshake is aborted because of link down. Stop handshake timer. */

                /* Stop the handshake timer */
                cy_rtos_stop_timer(&sta_handshake_timer);

                /* Stop the retry timer */
                cy_rtos_stop_timer(&sta_retry_timer);
                retry_backoff_timeout = DEFAULT_RETRY_BACKOFF_TIMEOUT_IN_MS;

                link_down(event_header->reason);
            }
        }
        break;

    case WLC_E_DEAUTH_IND:
    case WLC_E_DISASSOC_IND:
        link_down(event_header->reason);
        break;

    case WLC_E_PSK_SUP:
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "recieved WLC_E_PSK_SUP \n");
        /* WLC_E_PSK_SUP is received. Check for status and reason. */
        if (event_header->status == WLC_SUP_KEYED && event_header->reason == WLC_E_SUP_OTHER && link_up_event_received == WHD_TRUE)
        {
            /* Successful WPA key exchange. Stop timer and announce link up event to application */

            /* Stop handshake Timer */
            cy_rtos_stop_timer(&sta_handshake_timer);

            /* Stop retry Timer */
            cy_rtos_stop_timer(&sta_retry_timer);

            retry_backoff_timeout = DEFAULT_RETRY_BACKOFF_TIMEOUT_IN_MS;

            link_up();
            link_up_event_received = WHD_FALSE;
        }
        else if (event_header->reason == WLC_E_SUP_MSG3_TOO_MANY_IE)
        {
            /* Wi-Fi firmware will do disassoc internally and will not retry to join the AP.
             * Set a flag to indicate the join should be retried (from the host side).
             */
            too_many_ie_error = WHD_TRUE;
        }
        break;
    }
    case WLC_E_CSA_COMPLETE_IND:
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "recieved WLC_E_CSA_COMPLETE_IND \n");
        handshake_timeout_handler(0);
        break;
    }
    /* Note - These are listed to keep gcc pedantic checking happy */
    case WLC_E_NONE:
    case WLC_E_ROAM:
    case WLC_E_SET_SSID:
    case WLC_E_DEAUTH:
    case WLC_E_DISASSOC:
    case WLC_E_JOIN:
    case WLC_E_START:
    case WLC_E_AUTH:
    case WLC_E_AUTH_IND:
    case WLC_E_ASSOC:
    case WLC_E_ASSOC_IND:
    case WLC_E_REASSOC:
    case WLC_E_REASSOC_IND:
    case WLC_E_QUIET_START:
    case WLC_E_QUIET_END:
    case WLC_E_BEACON_RX:
    case WLC_E_MIC_ERROR:
    case WLC_E_NDIS_LINK:
    case WLC_E_TXFAIL:
    case WLC_E_PMKID_CACHE:
    case WLC_E_RETROGRADE_TSF:
    case WLC_E_PRUNE:
    case WLC_E_AUTOAUTH:
    case WLC_E_EAPOL_MSG:
    case WLC_E_SCAN_COMPLETE:
    case WLC_E_ADDTS_IND:
    case WLC_E_DELTS_IND:
    case WLC_E_BCNSENT_IND:
    case WLC_E_BCNRX_MSG:
    case WLC_E_BCNLOST_MSG:
    case WLC_E_ROAM_PREP:
    case WLC_E_PFN_NET_FOUND:
    case WLC_E_PFN_NET_LOST:
    case WLC_E_RESET_COMPLETE:
    case WLC_E_JOIN_START:
    case WLC_E_ROAM_START:
    case WLC_E_ASSOC_START:
    case WLC_E_IBSS_ASSOC:
    case WLC_E_RADIO:
    case WLC_E_PSM_WATCHDOG:
    case WLC_E_CCX_ASSOC_START:
    case WLC_E_CCX_ASSOC_ABORT:
    case WLC_E_PROBREQ_MSG:
    case WLC_E_SCAN_CONFIRM_IND:
    case WLC_E_COUNTRY_CODE_CHANGED:
    case WLC_E_EXCEEDED_MEDIUM_TIME:
    case WLC_E_ICV_ERROR:
    case WLC_E_UNICAST_DECODE_ERROR:
    case WLC_E_MULTICAST_DECODE_ERROR:
    case WLC_E_TRACE:
    case WLC_E_BTA_HCI_EVENT:
    case WLC_E_IF:
    case WLC_E_P2P_DISC_LISTEN_COMPLETE:
    case WLC_E_RSSI:
    case WLC_E_PFN_SCAN_COMPLETE:
    case WLC_E_EXTLOG_MSG:
    case WLC_E_ACTION_FRAME:
    case WLC_E_ACTION_FRAME_COMPLETE:
    case WLC_E_PRE_ASSOC_IND:
    case WLC_E_PRE_REASSOC_IND:
    case WLC_E_CHANNEL_ADOPTED:
    case WLC_E_AP_STARTED:
    case WLC_E_DFS_AP_STOP:
    case WLC_E_DFS_AP_RESUME:
    case WLC_E_WAI_STA_EVENT:
    case WLC_E_WAI_MSG:
    case WLC_E_ESCAN_RESULT:
    case WLC_E_ACTION_FRAME_OFF_CHAN_COMPLETE:
    case WLC_E_PROBRESP_MSG:
    case WLC_E_P2P_PROBREQ_MSG:
    case WLC_E_DCS_REQUEST:
    case WLC_E_FIFO_CREDIT_MAP:
    case WLC_E_ACTION_FRAME_RX:
    case WLC_E_WAKE_EVENT:
    case WLC_E_RM_COMPLETE:
    case WLC_E_HTSFSYNC:
    case WLC_E_OVERLAY_REQ:
    case WLC_E_EXCESS_PM_WAKE_EVENT:
    case WLC_E_PFN_SCAN_NONE:
    case WLC_E_PFN_SCAN_ALLGONE:
    case WLC_E_GTK_PLUMBED:
    case WLC_E_ASSOC_IND_NDIS:
    case WLC_E_REASSOC_IND_NDIS:
    case WLC_E_ASSOC_REQ_IE:
    case WLC_E_ASSOC_RESP_IE:
    case WLC_E_ASSOC_RECREATED:
    case WLC_E_ACTION_FRAME_RX_NDIS:
    case WLC_E_AUTH_REQ:
    case WLC_E_TDLS_PEER_EVENT:
    case WLC_E_SPEEDY_RECREATE_FAIL:
    case WLC_E_NATIVE:
    case WLC_E_PKTDELAY_IND:
    case WLC_E_AWDL_AW:
    case WLC_E_AWDL_ROLE:
    case WLC_E_AWDL_EVENT:
    case WLC_E_NIC_AF_TXS:
    case WLC_E_NAN:
    case WLC_E_BEACON_FRAME_RX:
    case WLC_E_SERVICE_FOUND:
    case WLC_E_GAS_FRAGMENT_RX:
    case WLC_E_GAS_COMPLETE:
    case WLC_E_P2PO_ADD_DEVICE:
    case WLC_E_P2PO_DEL_DEVICE:
    case WLC_E_WNM_STA_SLEEP:
    case WLC_E_TXFAIL_THRESH:
    case WLC_E_PROXD:
    case WLC_E_IBSS_COALESCE:
    case WLC_E_AWDL_RX_PRB_RESP:
    case WLC_E_AWDL_RX_ACT_FRAME:
    case WLC_E_AWDL_WOWL_NULLPKT:
    case WLC_E_AWDL_PHYCAL_STATUS:
    case WLC_E_AWDL_OOB_AF_STATUS:
    case WLC_E_AWDL_SCAN_STATUS:
    case WLC_E_AWDL_AW_START:
    case WLC_E_AWDL_AW_END:
    case WLC_E_AWDL_AW_EXT:
    case WLC_E_AWDL_PEER_CACHE_CONTROL:
    case WLC_E_CSA_START_IND:
    case WLC_E_CSA_DONE_IND:
    case WLC_E_CSA_FAILURE_IND:
    case WLC_E_CCA_CHAN_QUAL:
    case WLC_E_BSSID:
    case WLC_E_TX_STAT_ERROR:
    case WLC_E_BCMC_CREDIT_SUPPORT:
    case WLC_E_PSTA_PRIMARY_INTF_IND:
    case WLC_E_RRM:
    case WLC_E_ULP:
    case WLC_E_LAST:
    case WLC_E_BT_WIFI_HANDOVER_REQ:
    case WLC_E_PFN_BEST_BATCHING:
    case WLC_E_SPW_TXINHIBIT:
    case WLC_E_FBT_AUTH_REQ_IND:
    case WLC_E_RSSI_LQM:
    case WLC_E_PFN_GSCAN_FULL_RESULT:
    case WLC_E_PFN_SWC:
    case WLC_E_AUTHORIZED:
    case WLC_E_PROBREQ_MSG_RX:
    case WLC_E_RMC_EVENT:
    case WLC_E_DPSTA_INTF_IND:
    default:
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Received event which was not registered\n");
        break;
    }
    return handler_user_data;
}

static void link_up(void)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    UNUSED_PARAMETER(res);
    if (!wcm_sta_link_up)
    {
        if ((res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, sta_link_up_handler, NULL)) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to handle link up event. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
            return;
        }
        wcm_sta_link_up = true;
    }
    else
    {
        /* Do not renew DHCP if the link was connected through static IP */
        if (connected_ap_details.static_ip.addr.ip.v4 != 0)
        {
            return;
        }
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Executing DHCP renewal \n");
        /* This condition will be hit when handshake fails and wcm reconnection is successful through retry timer*/
        if ((res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, sta_link_up_renew_handler, NULL)) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to handle link up event. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
            return;
        }
    }
}

static void sta_link_up_handler(void* arg)
{
    UNUSED_PARAMETER(arg);
    cy_rslt_t res = CY_RSLT_SUCCESS;

