RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
static void network_down(whd_interface_t interface, cy_network_hw_interface_type_t iface_type)
{
    if (iface_type == CY_NETWORK_WIFI_STA_INTERFACE)
    {
        cy_network_ip_down(nw_sta_if_ctx);
        is_sta_network_up = false;
        cy_network_remove_nw_interface(nw_sta_if_ctx);
        is_sta_interface_created = false;
    }
    else
    {
        cy_network_ip_down(nw_ap_if_ctx);
        cy_network_remove_nw_interface(nw_ap_if_ctx);
        is_ap_network_up = false;
    }
}

static whd_security_t wcm_to_whd_security(cy_wcm_security_t sec)
{
    switch (sec)
    {
    case CY_WCM_SECURITY_OPEN :
        return WHD_SECURITY_OPEN;

    case CY_WCM_SECURITY_WEP_PSK:
        return WHD_SECURITY_WEP_PSK;

    case CY_WCM_SECURITY_WEP_SHARED:
        return WHD_SECURITY_WEP_SHARED;

    case CY_WCM_SECURITY_WPA_TKIP_PSK:
        return WHD_SECURITY_WPA_TKIP_PSK;

    case CY_WCM_SECURITY_WPA_AES_PSK:
        return WHD_SECURITY_WPA_AES_PSK;

    case CY_WCM_SECURITY_WPA_MIXED_PSK:
        return WHD_SECURITY_WPA_MIXED_PSK;

    case CY_WCM_SECURITY_WPA2_AES_PSK:
        return WHD_SECURITY_WPA2_AES_PSK;

    case CY_WCM_SECURITY_WPA2_AES_PSK_SHA256:
        return WHD_SECURITY_WPA2_AES_PSK_SHA256;

    case CY_WCM_SECURITY_WPA2_TKIP_PSK:
        return WHD_SECURITY_WPA2_TKIP_PSK;

    case CY_WCM_SECURITY_WPA2_MIXED_PSK:
        return WHD_SECURITY_WPA2_MIXED_PSK;

    case CY_WCM_SECURITY_WPA2_FBT_PSK:
        return WHD_SECURITY_WPA2_FBT_PSK;

    case CY_WCM_SECURITY_WPA3_SAE:
        return WHD_SECURITY_WPA3_SAE;

    case CY_WCM_SECURITY_WPA2_WPA_AES_PSK:
        return WHD_SECURITY_WPA2_WPA_AES_PSK;

    case CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK:
        return WHD_SECURITY_WPA2_WPA_MIXED_PSK;

    case CY_WCM_SECURITY_WPA3_WPA2_PSK:
        return WHD_SECURITY_WPA3_WPA2_PSK;

    case CY_WCM_SECURITY_WPA_TKIP_ENT:
        return WHD_SECURITY_WPA_TKIP_ENT;

    case CY_WCM_SECURITY_WPA_AES_ENT:
        return WHD_SECURITY_WPA_AES_ENT;

    case CY_WCM_SECURITY_WPA_MIXED_ENT:
        return WHD_SECURITY_WPA_MIXED_ENT;

    case CY_WCM_SECURITY_WPA2_TKIP_ENT:
        return WHD_SECURITY_WPA2_TKIP_ENT;

    case CY_WCM_SECURITY_WPA2_AES_ENT:
        return WHD_SECURITY_WPA2_AES_ENT;

#ifdef COMPONENT_CAT5
    case CY_WCM_SECURITY_WPA3_ENT:
        return WHD_SECURITY_WPA3_ENT;

    case CY_WCM_SECURITY_WPA3_ENT_AES_CCMP:
        return WHD_SECURITY_WPA3_ENT_AES_CCMP;

    case CY_WCM_SECURITY_WPA3_192BIT_ENT:
        return WHD_SECURITY_WPA3_192BIT_ENT;
#endif

    case CY_WCM_SECURITY_WPA2_MIXED_ENT:
        return WHD_SECURITY_WPA2_MIXED_ENT;

    case CY_WCM_SECURITY_WPA2_FBT_ENT:
        return WHD_SECURITY_WPA2_FBT_ENT;

    case CY_WCM_SECURITY_IBSS_OPEN:
        return WHD_SECURITY_IBSS_OPEN;

    case CY_WCM_SECURITY_WPS_SECURE:
        return WHD_SECURITY_WPS_SECURE;

#ifdef COMPONENT_WIFI6
    case CY_WCM_SECURITY_OWE:
        return WHD_SECURITY_WPA3_OWE;
#endif

    default:
        return WHD_SECURITY_UNKNOWN;
    }
}

cy_wcm_security_t whd_to_wcm_security(whd_security_t sec)
{
    switch (sec)
    {
    case WHD_SECURITY_OPEN:
        return CY_WCM_SECURITY_OPEN;

    case WHD_SECURITY_WEP_PSK:
        return CY_WCM_SECURITY_WEP_PSK;

    case WHD_SECURITY_WEP_SHARED:
        return CY_WCM_SECURITY_WEP_SHARED;

    case WHD_SECURITY_WPA_TKIP_PSK:
        return CY_WCM_SECURITY_WPA_TKIP_PSK;

    case WHD_SECURITY_WPA_AES_PSK:
        return CY_WCM_SECURITY_WPA_AES_PSK;

    case WHD_SECURITY_WPA_MIXED_PSK:
        return CY_WCM_SECURITY_WPA_MIXED_PSK;

    case WHD_SECURITY_WPA2_AES_PSK_SHA256:
        return CY_WCM_SECURITY_WPA2_AES_PSK_SHA256;

    case WHD_SECURITY_WPA2_AES_PSK:
        return CY_WCM_SECURITY_WPA2_AES_PSK;

    case WHD_SECURITY_WPA2_TKIP_PSK:
        return CY_WCM_SECURITY_WPA2_TKIP_PSK;

    case WHD_SECURITY_WPA2_MIXED_PSK:
        return CY_WCM_SECURITY_WPA2_MIXED_PSK;

    case WHD_SECURITY_WPA2_FBT_PSK:
        return CY_WCM_SECURITY_WPA2_FBT_PSK;

    case WHD_SECURITY_WPA3_SAE:
        return CY_WCM_SECURITY_WPA3_SAE;

    case WHD_SECURITY_WPA2_WPA_AES_PSK:
        return CY_WCM_SECURITY_WPA2_WPA_AES_PSK;

    case WHD_SECURITY_WPA2_WPA_MIXED_PSK:
        return CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK;

    case WHD_SECURITY_WPA3_WPA2_PSK:
        return CY_WCM_SECURITY_WPA3_WPA2_PSK;

    case WHD_SECURITY_WPA_TKIP_ENT:
        return CY_WCM_SECURITY_WPA_TKIP_ENT;

    case WHD_SECURITY_WPA_AES_ENT:
        return CY_WCM_SECURITY_WPA_AES_ENT;

    case WHD_SECURITY_WPA_MIXED_ENT:
        return CY_WCM_SECURITY_WPA_MIXED_ENT;

    case WHD_SECURITY_WPA2_TKIP_ENT:
        return CY_WCM_SECURITY_WPA2_TKIP_ENT;

    case WHD_SECURITY_WPA2_AES_ENT:
        return CY_WCM_SECURITY_WPA2_AES_ENT;

#ifdef COMPONENT_CAT5
    case WHD_SECURITY_WPA3_192BIT_ENT:
        return CY_WCM_SECURITY_WPA3_192BIT_ENT;

    case WHD_SECURITY_WPA3_ENT_AES_CCMP:
        return CY_WCM_SECURITY_WPA3_ENT_AES_CCMP;

    case WHD_SECURITY_WPA3_ENT:
        return CY_WCM_SECURITY_WPA3_ENT;
#endif

    case WHD_SECURITY_WPA2_MIXED_ENT:
        return CY_WCM_SECURITY_WPA2_MIXED_ENT;

    case WHD_SECURITY_WPA2_FBT_ENT:
        return CY_WCM_SECURITY_WPA2_FBT_ENT;

    case WHD_SECURITY_IBSS_OPEN:
        return CY_WCM_SECURITY_IBSS_OPEN;

    case WHD_SECURITY_WPS_SECURE:
        return CY_WCM_SECURITY_WPS_SECURE;

#ifdef COMPONENT_WIFI6
    case WHD_SECURITY_WPA3_OWE:
        return CY_WCM_SECURITY_OWE;
#endif

    default:
        return CY_WCM_SECURITY_UNKNOWN;
    }
}

static cy_wcm_wifi_band_t whd_to_wcm_band(whd_802_11_band_t band)
{
    if (band == WHD_802_11_BAND_5GHZ)
    {
        return CY_WCM_WIFI_BAND_5GHZ;
    }
    else if (band == WHD_802_11_BAND_2_4GHZ)
    {
        return CY_WCM_WIFI_BAND_2_4GHZ;
    }
    else
    {
        return CY_WCM_WIFI_BAND_6GHZ;
    }
}

static cy_wcm_bss_type_t whd_to_wcm_bss_type(whd_bss_type_t bss_type)
{
    switch (bss_type)
    {
    case WHD_BSS_TYPE_INFRASTRUCTURE:
        return CY_WCM_BSS_TYPE_INFRASTRUCTURE;

    case WHD_BSS_TYPE_ADHOC:
        return CY_WCM_BSS_TYPE_ADHOC;

    case WHD_BSS_TYPE_ANY:
        return CY_WCM_BSS_TYPE_ANY;

