RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
    case WHD_BSS_TYPE_MESH:
        return CY_WCM_BSS_TYPE_MESH;

    default :
        return CY_WCM_BSS_TYPE_UNKNOWN;
    }
}

static void read_ap_config(const cy_wcm_ap_config_t *ap_config, whd_ssid_t *ssid,
                           uint8_t **key, uint8_t *keylen, whd_security_t *security, cy_network_static_ip_addr_t *static_ip_addr)
{
    ssid->length = (uint8_t)strlen((char*)ap_config->ap_credentials.SSID);
    memcpy(&ssid->value, ap_config->ap_credentials.SSID, ssid->length + 1);

    *keylen = strlen((char*)ap_config->ap_credentials.password);
    *key = (uint8_t*)ap_config->ap_credentials.password;
    *security = wcm_to_whd_security(ap_config->ap_credentials.security);

    memset(static_ip_addr, 0, sizeof(cy_network_static_ip_addr_t));
    if (ap_config->ip_settings.gateway.version == CY_WCM_IP_VER_V4)
    {
        static_ip_addr->gateway.ip.v4 = ap_config->ip_settings.gateway.ip.v4;
        static_ip_addr->addr.ip.v4    = ap_config->ip_settings.ip_address.ip.v4;
        static_ip_addr->netmask.ip.v4 = ap_config->ip_settings.netmask.ip.v4;
    }
}

static cy_rslt_t check_soft_ap_config(const cy_wcm_ap_config_t *ap_config_params)
{
    uint8_t ssid_len;
    uint8_t pwd_len;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    whd_interface_t prim_ifp;
    if (whd_ifs[CY_WCM_INTERFACE_TYPE_AP] == NULL)
    {
        return CY_RSLT_WCM_INTERFACE_NOT_UP;
    }
    /* In concurrent mode (AP+STA), use the primary interface(STA) to get the band-list and channel_list, as only the
     * primary interface is initialized at this point.
     * This is as per the recommendation provided by WHD.
     * Note: This does not affect the AP mode since the primary interface will be the AP interface itself.
     */
    prim_ifp = whd_get_primary_interface(whd_ifs[CY_WCM_INTERFACE_TYPE_AP]->whd_driver);

    if (ap_config_params == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    ssid_len = (uint8_t)strlen((char*)ap_config_params->ap_credentials.SSID);
    pwd_len  = (uint8_t)strlen((char*)ap_config_params->ap_credentials.password);

    if (ap_config_params->ip_settings.ip_address.ip.v4 == 0)
    {
        return CY_RSLT_WCM_BAD_STATIC_IP;
    }

    if (ssid_len == 0 || ssid_len > CY_WCM_MAX_SSID_LEN)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "SSID length error\n");
        return CY_RSLT_WCM_BAD_SSID_LEN;
    }

    if (!check_wcm_security(ap_config_params->ap_credentials.security))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "AP credentials security error\n");
        return CY_RSLT_WCM_SECURITY_NOT_SUPPORTED;
    }

#ifdef COMPONENT_WIFI6
    if (ap_config_params->ap_credentials.security == CY_WCM_SECURITY_OWE)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "OWE security not supported\n");
        return CY_RSLT_WCM_SECURITY_NOT_SUPPORTED;
    }
#endif

    if ((ap_config_params->ap_credentials.security != CY_WCM_SECURITY_OPEN) &&
            (pwd_len < CY_WCM_MIN_PASSPHRASE_LEN || pwd_len > CY_WCM_MAX_PASSPHRASE_LEN))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "AP credentials passphrase length error. Length must be between 8 and 63\n");
        return CY_RSLT_WCM_BAD_PASSPHRASE_LEN;
    }

    if (ap_config_params->ie_info != NULL)
    {
        if (ap_config_params->ie_info->data == NULL)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid IE \n");
            return CY_RSLT_WCM_INVALID_IE;
        }
    }

    /*
     * Validate the band and update the appropriate error code
     * channel number 1 to 11 is 2G
     * channel number 36 to 165 is 5G
     * channel number 1 to 233 is 6G
     */
    do
    {
        if (ap_config_params->band != CY_WCM_WIFI_BAND_6GHZ)
        {
            if ((ap_config_params->channel > 0) && (ap_config_params->channel < 12))
            {
                /* All platforms by default supports 2.4Ghz so return success*/
                break;
            }
            else if ((ap_config_params->channel > 35) && (ap_config_params->channel < 166))
            {
                if (!check_if_platform_supports_band(prim_ifp, CY_WCM_WIFI_BAND_5GHZ))
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "5GHz band not supported \n");
                    result = CY_RSLT_WCM_BAND_NOT_SUPPORTED;
                    break;
                }
            }
            else
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid channel. Channel not in expected range \n");
                result = CY_RSLT_WCM_AP_BAD_CHANNEL;
                break;
            }
        }
        else
        {
            /* For 6GHz band */
            if ((ap_config_params->channel > 0) && (ap_config_params->channel < 234))
            {
                if (!check_if_platform_supports_band(prim_ifp, CY_WCM_WIFI_BAND_6GHZ))
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "6GHz band not supported \n");
                    result = CY_RSLT_WCM_BAND_NOT_SUPPORTED;
                    break;
                }
            }
        }
    }
    while (0);

    /*
     * Validate if the given channel is supported on the kit and update appropriate error codes.
     */
    if (result == CY_RSLT_SUCCESS)
    {
        whd_list_t *whd_channel_list;
        uint32_t channel_buf[ MAXCHANNEL + 1 ];
        whd_channel_list = (whd_list_t *)(void *)channel_buf;
        uint8_t index;
        cy_rslt_t res;

        whd_channel_list->count = MAXCHANNEL;  /* Initialize to maximum channels that can be supported as defined in WHD */

        res = whd_wifi_get_channels(prim_ifp, whd_channel_list);
        if (res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_get_channels failed \n");
            return CY_RSLT_WCM_BAD_ARG;
        }

        for (index = 0; index < whd_channel_list->count; index++)
        {
            if (ap_config_params->channel == *(whd_channel_list->element + index))
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Input channel is supported \n");
                break;
            }
        }
        if (index == whd_channel_list->count)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Channel \n");
            return CY_RSLT_WCM_AP_BAD_CHANNEL;
        }
    }

    return result;
}

static cy_rslt_t init_whd_wifi_interface(cy_wcm_config_t *config)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    if (config->interface != CY_WCM_INTERFACE_TYPE_AP_STA)
    {
#ifndef COMPONENT_MTB_HAL
        result = cybsp_wifi_init_primary(&whd_ifs[iface_type]);

#else
#if MTB_HAL_DRIVER_AVAILABLE_SDIO
        result = cybsp_wifi_init_primary_sdio(&whd_ifs[config->interface], NULL, NULL, NULL, NULL,
                                              config->wifi_interface_instance,
                                              &config->wifi_host_wake_pin,
                                              &config->wifi_wl_pin);
#else
#error "This interface is not supported"
#endif
#endif
        if (result != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in initializing primary interface !!\n");
            return CY_RSLT_WCM_BSP_INIT_ERROR;
        }

