RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/wifi-connection-manager/source/cy_wcm.c
    }
    else
    {
        /* In concurrent mode primary interface would be STA and secondary AP*/
#ifndef COMPONENT_MTB_HAL
        result = cybsp_wifi_init_primary(&whd_ifs[CY_WCM_INTERFACE_TYPE_STA]);
#else
#if MTB_HAL_DRIVER_AVAILABLE_SDIO
        result = cybsp_wifi_init_primary_sdio(&whd_ifs[CY_WCM_INTERFACE_TYPE_STA], NULL, NULL, NULL, NULL,
                                              config->wifi_interface_instance,
                                              &config->wifi_host_wake_pin,
                                              &config->wifi_wl_pin);
#else
#error "This interface is not supported"
#endif
#endif

        if (result != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in getting primary interface mac address !!\n");
            return CY_RSLT_WCM_BSP_INIT_ERROR;
        }

        /* SoftAP is the secondary interface in Concurrent mode*/
        if (cybsp_wifi_init_secondary(&whd_ifs[CY_WCM_INTERFACE_TYPE_AP], NULL) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error Unable to bring up the secondary interface !!\n");
            return CY_RSLT_WCM_SECONDARY_INTERFACE_ERROR;
        }
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_get_whd_interface(cy_wcm_interface_t interface_type, whd_interface_t *whd_iface)
{
    if (whd_iface == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : bad arguments \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    if (!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. Call cy_wcm_init() to initialize \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if ((interface_type != CY_WCM_INTERFACE_TYPE_STA) || (current_interface == CY_WCM_INTERFACE_TYPE_AP))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Supported only for STA interface !!\n");
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    *whd_iface = whd_ifs[interface_type];
    return CY_RSLT_SUCCESS;
}

static bool check_if_ent_auth_types(cy_wcm_security_t auth_type)
{
    if ((auth_type == CY_WCM_SECURITY_WPA_TKIP_ENT) || (auth_type == CY_WCM_SECURITY_WPA_AES_ENT) ||
            (auth_type == CY_WCM_SECURITY_WPA_MIXED_ENT) || (auth_type == CY_WCM_SECURITY_WPA2_TKIP_ENT) ||
            (auth_type == CY_WCM_SECURITY_WPA2_AES_ENT) || (auth_type == CY_WCM_SECURITY_WPA2_MIXED_ENT) ||
            (auth_type == CY_WCM_SECURITY_WPA2_FBT_ENT)
#ifdef COMPONENT_CAT5
            || (auth_type == CY_WCM_SECURITY_WPA3_ENT)
            || (auth_type == CY_WCM_SECURITY_WPA3_192BIT_ENT)
            || (auth_type == CY_WCM_SECURITY_WPA3_ENT_AES_CCMP)
#endif
       )
    {
        return true;
    }

    return false;
}

cy_rslt_t cy_wcm_set_ap_ip_setting(cy_wcm_ip_setting_t *ap_ip, const char *ip_addr, const char *netmask, const char *gateway_addr, cy_wcm_ip_version_t ver)
{
    cy_rslt_t          res = CY_RSLT_SUCCESS;
    cy_nw_ip_address_t temp;

    if (ap_ip == NULL || ip_addr == NULL || netmask == NULL || gateway_addr == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Null value passed to cy_wcm_ap_ip_setting \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    if ((ver != CY_WCM_IP_VER_V4) && (ver != CY_WCM_IP_VER_V6))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Invalid version passed to cy_wcm_set_ap_ip_setting \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if ((res = cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return res;
    }

    cy_nw_aton(ip_addr, &temp);
    ap_ip->ip_address.ip.v4 =  temp.ip.v4;

    cy_nw_aton(netmask, &temp);
    ap_ip->netmask.ip.v4 =  temp.ip.v4;

    cy_nw_aton(gateway_addr, &temp);
    ap_ip->gateway.ip.v4 =  temp.ip.v4;

    ap_ip->ip_address.version = ver;
    ap_ip->netmask.version = ver;
    ap_ip->gateway.version = ver;

    if ((res = cy_rtos_set_mutex(&wcm_mutex)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to release WCM mutex \n");
    }
    return res;
}

cy_rslt_t cy_wcm_allow_low_power_mode(cy_wcm_powersave_mode_t mode)
{
    cy_rslt_t       rslt = CY_RSLT_SUCCESS;
    whd_interface_t ifp = NULL;
    uint16_t        wlan_chip_id = 0;

    if (cy_wcm_get_whd_interface(CY_WCM_INTERFACE_TYPE_STA, &ifp) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    /* get chip ID */
    wlan_chip_id = whd_chip_get_chip_id(ifp->whd_driver);

    /* Disable WLAN PM/mpc for 43907 low power issue */
    if ((wlan_chip_id == CY_WCM_WLAN_CHIP_ID_43909) || (wlan_chip_id == CY_WCM_WLAN_CHIP_ID_43907) || (wlan_chip_id == CY_WCM_WLAN_CHIP_ID_54907))
    {
        switch (mode)
        {
        case CY_WCM_NO_POWERSAVE_MODE:
            rslt = whd_wifi_disable_powersave(ifp);
            if (rslt == WHD_SUCCESS)
            {
                rslt = whd_wifi_set_iovar_value(ifp, IOVAR_STR_MPC, 0);
            }
            break;
        case CY_WCM_PM1_POWERSAVE_MODE:    /*  Powersave mode on specified interface without regard for throughput reduction */
            rslt = whd_wifi_enable_powersave(ifp);
            if (rslt == WHD_SUCCESS)
            {
                rslt = whd_wifi_set_iovar_value(ifp, IOVAR_STR_MPC, 1);
            }
            break;
        case CY_WCM_PM2_POWERSAVE_MODE:    /* Powersave mode on specified interface with High throughput */
            rslt = whd_wifi_enable_powersave_with_throughput(ifp, DEFAULT_PM2_SLEEP_RET_TIME);
            if (rslt == WHD_SUCCESS)
            {
                rslt = whd_wifi_set_iovar_value(ifp, IOVAR_STR_MPC, 1);
            }
            break;
        default:
            rslt = CY_RSLT_WCM_BAD_ARG;
            break;
        }

        if (rslt != WHD_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to change powersave mode.\n");
        }
    }
    else
    {
        rslt = CY_RSLT_WCM_POWERSAVE_MODE_NOT_SUPPORTED;
    }
    return rslt;
}

#endif
